# -*- coding: utf-8 -*-
"""
Thai alphabets
"""


def get_data():
    """
    Get a list of Thai alphabets (from Ko Kai \u0e01 to Ho Nokhuk \u0e2e)
    คืนค่า list ที่มีพญัชนะไทย ก (\u0e01) - ฮ (\u0e2e)
    """
    return [
        "ก",
        "ข",
        "ฃ",
        "ค",
        "ฅ",
        "ฆ",
        "ง",
        "จ",
        "ฉ",
        "ช",
        "ซ",
        "ฌ",
        "ญ",
        "ฎ",
        "ฏ",
        "ฐ",
        "ฑ",
        "ฒ",
        "ณ",
        "ด",
        "ต",
        "ถ",
        "ท",
        "ธ",
        "น",
        "บ",
        "ป",
        "ผ",
        "ฝ",
        "พ",
        "ฟ",
        "ภ",
        "ม",
        "ย",
        "ร",
        "ล",
        "ว",
        "ศ",
        "ษ",
        "ส",
        "ห",
        "ฬ",
        "อ",
        "ฮ",
    ]
