{"input_char2idx": {"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "<UNK>": 3, "ร": 4, "ู": 5, "้": 6, "เ": 7, "ห": 8, "็": 9, "น": 10, "ไ": 11, "ซ": 12, "ต": 13, "ั": 14, "ง": 15, "ม": 16, "า": 17, "บ": 18, "ว": 19, "ส": 20, "ฤ": 21, "ด": 22, "ก": 23, "ุ": 24, "ะ": 25, "ื": 26, "อ": 27, "โ": 28, "ิ": 29, "่": 30, "ฏ": 31, "แ": 32, "ฟ": 33, "ใ": 34, "ข": 35, "ฮ": 36, "ย": 37, "ฃ": 38, "ล": 39, "์": 40, "ำ": 41, "ป": 42, "ช": 43, "ี": 44, "ค": 45, "ณ": 46, "พ": 47, "ึ": 48, "ญ": 49, "ท": 50, "ธ": 51, "ฺ": 52, "ภ": 53, "ผ": 54, "ฝ": 55, "ฉ": 56, "จ": 57, "ฐ": 58, "ฆ": 59, "ศ": 60, "๋": 61, "ถ": 62, "ํ": 63, "ฎ": 64, "๊": 65, "ๅ": 66, " ": 67, "ๆ": 68, "ษ": 69, "-": 70, "ฌ": 71, "ฬ": 72, "ฯ": 73, "ฑ": 74, "ฅ": 75, "ฒ": 76, "ฦ": 77, "๎": 78, "๏": 79}, "target_idx2char": {"0": "<PAD>", "1": "<SOS>", "2": "<EOS>", "3": "<UNK>", "4": "/", "5": "r", "6": "u", "7": "ː", "8": "˦", "9": "˥", "10": ".", "11": "h", "12": "e", "13": "n", "14": "˩", "15": "s", "16": "a", "17": "j", "18": "t", "19": "ŋ", "20": "o", "21": "p", "22": "̚", "23": "w", "24": "˨", "25": "ɯ", "26": "d", "27": "˧", "28": "k", "29": "m", "30": "i", "31": "ʰ", "32": "̯", "33": "b", "34": "ə", "35": "ʔ", "36": "[", "37": "ä", "38": "ɔ", "39": "̃", "40": "]", "41": "ɤ", "42": "ɛ", "43": "͡", "44": "ɕ", "45": "f", "46": "l", "47": "ʌ", "48": "ˈ", "49": "~", "50": "ɪ", "51": "ᵊ", "52": "ɲ", "53": " ", "54": "-", "55": "ʊ", "56": "x", "57": "ɡ", "58": "ɣ", "59": "ɨ", "60": "ũ", "61": "v", "62": "æ", "63": "̂", "64": "ú", "65": "c", "66": "ç", "67": "̌", "68": "û", "69": "̩", "70": "ɗ", "71": "(", "72": ")", "73": "õ", "74": "ˀ", "75": "̊", "76": "ɟ", "77": "̥", "78": "ǐ", "79": "̀", "80": "á", "81": "ì", "82": "â", "83": "ɒ", "84": "ĩ", "85": "́", "86": "ǎ", "87": "í", "88": "ê", "89": "à", "90": "î", "91": "ṳ", "92": "̤", "93": "ù", "94": "ɓ", "95": "ǔ", "96": "è", "97": "ā", "98": "ã", "99": "̠", "100": "ʲ", "101": "z", "102": "ő", "103": "ě", "104": "ʉ", "105": "ó", "106": "ǒ", "107": "̍", "108": ",", "109": "é", "110": "ẽ", "111": "œ", "112": "ʋ", "113": "ɭ", "114": "ò", "115": "ʄ", "116": "̰", "117": "ă", "118": "ṹ", "119": "ô", "120": "ɳ", "121": "ɖ", "122": "+", "123": "ʃ", "124": "ʍ", "125": "ø", "126": "y", "127": "ī", "128": "ŭ", "129": "̪", "130": "ɐ"}}